In [7]:
# Creating a table
import pandas as pd
  
# Dataframe
df = pd.DataFrame({'team': ['Team 1', 'Team 1', 'Team 2',
                            'Team 3', 'Team 2', 'Team 3'],
                   'Subject': ['Math', 'Science', 'Science',
                               'Math', 'Science', 'Math'],
                   'points': [10, 8, 10, 6, 6, 5]})
  
df

     team  Subject  points
0  Team 1     Math      10
1  Team 1  Science       8
2  Team 2  Science      10
3  Team 3     Math       6
4  Team 2  Science       6
5  Team 3     Math       5

In [5]:
df[df["team"].str.contains("Team 1") == False] #deleting rows with Team 1

     team  Subject  points
2  Team 2  Science      10
3  Team 3     Math       6
4  Team 2  Science       6
5  Team 3     Math       5

In [8]:
df[df["team"].str.contains("Team 1|Team 2") == False] #deleting rows with Team 1 & Team 2

     team Subject  points
3  Team 3    Math       6
5  Team 3    Math       5